test_reports/load_testing_artillery/createItem.txt
Started phase 0, duration: 10s @ 13:14:56(-0700) 2020-06-04
Report @ 13:15:06(-0700) 2020-06-04
Elapsed time: 10 seconds
  Scenarios launched:  262
  Scenarios completed: 221
  Requests completed:  221
  Mean response/sec: 26.63
  Response time (msec):
    min: 869.9
    max: 949.5
    median: 896.3
    p95: 926.5
    p99: 940.6
  Codes:
    400: 221

Started phase 1, duration: 10s @ 13:15:07(-0700) 2020-06-04
Report @ 13:15:16(-0700) 2020-06-04
Elapsed time: 20 seconds
  Scenarios launched:  93
  Scenarios completed: 128
  Requests completed:  128
  Mean response/sec: 9.31
  Response time (msec):
    min: 857.4
    max: 990.2
    median: 891.4
    p95: 916.4
    p99: 957.2
  Codes:
    400: 128

Report @ 13:15:18(-0700) 2020-06-04
Elapsed time: 21 seconds
  Scenarios launched:  5
  Scenarios completed: 11
  Requests completed:  11
  Mean response/sec: 3.14
  Response time (msec):
    min: 847.5
    max: 881.5
    median: 862.1
    p95: 881.4
    p99: 881.5
  Codes:
    400: 11

All virtual users finished
Summary report @ 13:15:18(-0700) 2020-06-04
  Scenarios launched:  360
  Scenarios completed: 360
  Requests completed:  360
  Mean response/sec: 16.78
  Response time (msec):
    min: 847.5
    max: 990.2
    median: 893.2
    p95: 925.3
    p99: 941.9
  Scenario counts:
    0: 360 (100%)
  Codes:
    400: 360