test_reports/load_testing_artillery/createItemSet.txt
Started phase 0, duration: 30s @ 11:50:32(-0700) 2020-06-04
Report @ 11:50:42(-0700) 2020-06-04
Elapsed time: 10 seconds
  Scenarios launched:  257
  Scenarios completed: 230
  Requests completed:  230
  Mean response/sec: 25.99
  Response time (msec):
    min: 862.9
    max: 1083.1
    median: 894.6
    p95: 929.2
    p99: 1059.9
  Codes:
    200: 24
    400: 206

Report @ 11:50:52(-0700) 2020-06-04
Elapsed time: 20 seconds
  Scenarios launched:  336
  Scenarios completed: 328
  Requests completed:  328
  Mean response/sec: 33.6
  Response time (msec):
    min: 862.5
    max: 2762.1
    median: 897.6
    p95: 930.9
    p99: 951.5
  Codes:
    400: 328

Report @ 11:51:02(-0700) 2020-06-04
Elapsed time: 30 seconds
  Scenarios launched:  458
  Scenarios completed: 449
  Requests completed:  449
  Mean response/sec: 46
  Response time (msec):
    min: 861.3
    max: 960.1
    median: 891.8
    p95: 925.6
    p99: 945.6
  Codes:
    400: 449

Started phase 1, duration: 30s @ 11:51:02(-0700) 2020-06-04
Report @ 11:51:12(-0700) 2020-06-04
Elapsed time: 40 seconds
  Scenarios launched:  498
  Scenarios completed: 497
  Requests completed:  497
  Mean response/sec: 49.75
  Response time (msec):
    min: 858.4
    max: 951.8
    median: 883.7
    p95: 911
    p99: 927.5
  Codes:
    400: 497

Warning: 
CPU usage of Artillery seems to be very high (pids: 11416)
which may severely affect its performance.
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 11:51:22(-0700) 2020-06-04
Elapsed time: 50 seconds
  Scenarios launched:  501
  Scenarios completed: 461
  Requests completed:  461
  Mean response/sec: 50.35
  Response time (msec):
    min: 857.4
    max: 951.9
    median: 882.8
    p95: 910.1
    p99: 939
  Codes:
    400: 461

Report @ 11:51:32(-0700) 2020-06-04
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  500
  Scenarios completed: 8
  Requests completed:  8
  Mean response/sec: 50.15
  Response time (msec):
    min: 860.2
    max: 7890.2
    median: 1870.4
    p95: 7890.2
    p99: 7890.2
  Codes:
    400: 8

Warning: High CPU usage warning (pids: 11416).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 11:51:42(-0700) 2020-06-04
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  19
  Scenarios completed: 137
  Requests completed:  137
  Mean response/sec: 1.9
  Response time (msec):
    min: 1891.8
    max: 15937.8
    median: 15873.4
    p95: 15919.8
    p99: 15931.1
  Codes:
    400: 137
 

Report @ 11:51:52(-0700) 2020-06-04
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  0
  Scenarios completed: 126
  Requests completed:  126
  Mean response/sec: NaN
  Response time (msec):
    min: 15856.3
    max: 15954.8
    median: 15897.5
    p95: 15924.1
    p99: 15939.7
  Codes:
    400: 126


All virtual users finished
Summary report @ 11:51:53(-0700) 2020-06-04
  Scenarios launched:  2569
  Scenarios completed: 2236
  Requests completed:  2236
  Mean response/sec: 31.7
  Response time (msec):
    min: 857.4
    max: 15954.8
    median: 890.2
    p95: 15896.1
    p99: 15917
  Scenario counts:
    0: 2569 (100%)
  Codes:
    200: 24
    400: 2212