test_reports/load_testing_artillery/createLab.txt
Started phase 0, duration: 10s @ 04:36:45(-0700) 2020-06-05
Report @ 04:36:55(-0700) 2020-06-05
Elapsed time: 10 seconds
  Scenarios launched:  280
  Scenarios completed: 240
  Requests completed:  240
  Mean response/sec: 28.72
  Response time (msec):
    min: 853.4
    max: 1045.7
    median: 883.5
    p95: 914.8
    p99: 954.8
  Codes:
    200: 230
    400: 10

Started phase 1, duration: 10s @ 04:36:56(-0700) 2020-06-05
Report @ 04:37:05(-0700) 2020-06-05
Elapsed time: 20 seconds
  Scenarios launched:  92
  Scenarios completed: 126
  Requests completed:  126
  Mean response/sec: 9.21
  Response time (msec):
    min: 854.7
    max: 922.6
    median: 876.2
    p95: 902
    p99: 917.2
  Codes:
    200: 113
    400: 13

Report @ 04:37:07(-0700) 2020-06-05
Elapsed time: 22 seconds
  Scenarios launched:  5
  Scenarios completed: 11
  Requests completed:  11
  Mean response/sec: 3.16
  Response time (msec):
    min: 856.9
    max: 973.3
    median: 879.1
    p95: 969.7
    p99: 973.3
  Codes:
    200: 9
    400: 2

All virtual users finished
Summary report @ 04:37:07(-0700) 2020-06-05
  Scenarios launched:  377
  Scenarios completed: 377
  Requests completed:  377
  Mean response/sec: 17.65
  Response time (msec):
    min: 853.4
    max: 1045.7
    median: 881
    p95: 912.3
    p99: 945.6
  Scenario counts:
    0: 377 (100%)
  Codes:
    200: 352
    400: 25