test_reports/load_testing_artillery/createRequestItem1.txt
Started phase 0, duration: 10s @ 09:55:18(-0700) 2020-06-05
Report @ 09:55:28(-0700) 2020-06-05
Elapsed time: 10 seconds
  Scenarios launched:  264
  Scenarios completed: 224
  Requests completed:  224
  Mean response/sec: 26.75
  Response time (msec):
    min: 863.7
    max: 1055.1
    median: 894.4
    p95: 924.5
    p99: 963
  Codes:
    200: 2
    500: 222

Started phase 1, duration: 10s @ 09:55:29(-0700) 2020-06-05
Report @ 09:55:38(-0700) 2020-06-05
Elapsed time: 20 seconds
  Scenarios launched:  92
  Scenarios completed: 126
  Requests completed:  126
  Mean response/sec: 9.32
  Response time (msec):
    min: 864.5
    max: 944.7
    median: 891
    p95: 916.6
    p99: 940
  Codes:
    500: 126

Report @ 09:55:40(-0700) 2020-06-05
Elapsed time: 21 seconds
  Scenarios launched:  5
  Scenarios completed: 11
  Requests completed:  11
  Mean response/sec: 3.21
  Response time (msec):
    min: 870.8
    max: 897.4
    median: 887.6
    p95: 897.4
    p99: 897.4
  Codes:
    500: 11

All virtual users finished
Summary report @ 09:55:40(-0700) 2020-06-05
  Scenarios launched:  361
  Scenarios completed: 361
  Requests completed:  361
  Mean response/sec: 16.86
  Response time (msec):
    min: 863.7
    max: 1055.1
    median: 892.3
    p95: 920.6
    p99: 938.2
  Scenario counts:
    0: 361 (100%)
  Codes:
    200: 2
    500: 359