test_reports/load_testing_artillery/createRole.txt
Started phase 0, duration: 10s @ 05:21:05(-0700) 2020-06-05
Report @ 05:21:15(-0700) 2020-06-05
Elapsed time: 10 seconds
  Scenarios launched:  285
  Scenarios completed: 245
  Requests completed:  245
  Mean response/sec: 29.2
  Response time (msec):
    min: 845.3
    max: 1045.9
    median: 873.5
    p95: 908.6
    p99: 921.3
  Codes:
    400: 245

Started phase 1, duration: 10s @ 05:21:15(-0700) 2020-06-05
Report @ 05:21:25(-0700) 2020-06-05
Elapsed time: 20 seconds
  Scenarios launched:  93
  Scenarios completed: 127
  Requests completed:  127
  Mean response/sec: 9.33
  Response time (msec):
    min: 847.4
    max: 907.7
    median: 870.9
    p95: 891.5
    p99: 903.9
  Codes:
    400: 127

Report @ 05:21:26(-0700) 2020-06-05
Elapsed time: 21 seconds
  Scenarios launched:  5
  Scenarios completed: 11
  Requests completed:  11
  Mean response/sec: 3.25
  Response time (msec):
    min: 852.9
    max: 891.3
    median: 867.7
    p95: 890.7
    p99: 891.3
  Codes:
    400: 11

All virtual users finished
Summary report @ 05:21:26(-0700) 2020-06-05
  Scenarios launched:  383
  Scenarios completed: 383
  Requests completed:  383
  Mean response/sec: 17.93
  Response time (msec):
    min: 845.3
    max: 1045.9
    median: 871.9
    p95: 902.7
    p99: 919.3
  Scenario counts:
    0: 383 (100%)
  Codes:
    400: 383