test_reports/load_testing_artillery/deleteRoleById.txt
Started phase 0, duration: 10s @ 06:03:00(-0700) 2020-06-05
Report @ 06:03:10(-0700) 2020-06-05
Elapsed time: 10 seconds
  Scenarios launched:  282
  Scenarios completed: 237
  Requests completed:  237
  Mean response/sec: 28.62
  Response time (msec):
    min: 869.5
    max: 1124.6
    median: 913.8
    p95: 959.7
    p99: 1009.7
  Codes:
    200: 2
    400: 235

Started phase 1, duration: 10s @ 06:03:11(-0700) 2020-06-05
Report @ 06:03:20(-0700) 2020-06-05
Elapsed time: 20 seconds
  Scenarios launched:  92
  Scenarios completed: 131
  Requests completed:  131
  Mean response/sec: 9.31
  Response time (msec):
    min: 870.2
    max: 1022.4
    median: 911.9
    p95: 977.3
    p99: 1010.2
  Codes:
    400: 131

Report @ 06:03:22(-0700) 2020-06-05
Elapsed time: 21 seconds
  Scenarios launched:  5
  Scenarios completed: 11
  Requests completed:  11
  Mean response/sec: 3.23
  Response time (msec):
    min: 870.3
    max: 939.5
    median: 890.7
    p95: 938.6
    p99: 939.5
  Codes:
    400: 11

All virtual users finished
Summary report @ 06:03:22(-0700) 2020-06-05
  Scenarios launched:  379
  Scenarios completed: 379
  Requests completed:  379
  Mean response/sec: 17.67
  Response time (msec):
    min: 869.5
    max: 1124.6
    median: 912.1
    p95: 966.9
    p99: 1006.7
  Scenario counts:
    0: 379 (100%)
  Codes:
    200: 2
    400: 377